In [343]:
import pandas as pd
import numpy as np

### How-to-count-distance-to-the-previous-zero

to find- distance to closest zero
X: [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]
for 7 ans 2,
    2 is 1,
    0 is 0,
    3 is 1,
and so on
steps
first create a dataframe with a column x 
second add a column y with the ans

In [344]:
df = pd.DataFrame({"X": [7,2,0,3,4,2,5,0,3,4]})

In [345]:
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [346]:
df[df.X==0]

   X
2  0
7  0

In [347]:
result = []
for i in df.X.index:
    count = []   
    for j in df[df.X==0].index:
        distance = abs(j-i)
        count.append(distance)
        #final = min(count)
    result.append(min(count))

In [348]:
print(result)

[2, 1, 0, 1, 2, 2, 1, 0, 1, 2]

In [349]:
df["y"] = result

In [350]:
df

   X  y
0  7  2
1  2  1
2  0  0
3  3  1
4  4  2
5  2  2
6  5  1
7  0  0
8  3  1
9  4  2

### Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers.

In [351]:
calendar_2015 = pd.date_range(start = "2015 jan", end ="2015 dec 31", freq="D")

In [352]:
calendar = pd.Series(np.random.randint(low =1,high = 1000,  size = 365), index = calendar_2015)

In [353]:
df2 = pd.DataFrame(calendar, columns = ["s"])

https://pandas.pydata.org/pandas-docs/stable/api.html#datetimeindex

In [354]:
df2.head()

              s
2015-01-01   66
2015-01-02  586
2015-01-03  149
2015-01-04  985
2015-01-05  753

Find the sum of the values in s for every Wednesday

In [355]:
df2[df2.index.dayofweek == 2].sum()

s    26372
dtype: int64

 Average For each calendar month

In [356]:
average = []
for i in range(1,13):
    average.append(df2[df2.index.month== i].sum()/30)

In [357]:
len(average)

12

In [358]:
average

[s    501.9
 dtype: float64, s    428.166667
 dtype: float64, s    484.5
 dtype: float64, s    590.766667
 dtype: float64, s    536.766667
 dtype: float64, s    514.1
 dtype: float64, s    564.533333
 dtype: float64, s    472.766667
 dtype: float64, s    555.033333
 dtype: float64, s    483.333333
 dtype: float64, s    506.866667
 dtype: float64, s    419.5
 dtype: float64]

5) For each group of four consecutive calendar months in s, find the date on which the
highest value occurred.

In [359]:
highest_value = df2.groupby(by = df2.index.month).s.max()

In [360]:
highest_value

1     985
2     992
3     923
4     994
5     983
6     989
7     991
8     968
9     985
10    991
11    993
12    923
Name: s, dtype: int32

### first quarter

In [361]:
first_quarter = df2.loc['2015-01-01':'2015-04-30']

In [362]:
first_quarter[first_quarter["s"] ==first_quarter.s.max()]

              s
2015-04-09  994

## second

In [363]:
second_quarter =df2.loc['2015-05-01':'2015-08-31']

In [364]:
second_quarter[second_quarter["s"]== second_quarter.s.max()]

              s
2015-07-17  991

### third

In [365]:
third_quarter = df2.loc['2015-09-01':'2015-12-31']

In [366]:
third_quarter[third_quarter["s"] == third_quarter.s.max()]

              s
2015-11-09  993